USE [MDR]
GO

INSERT INTO [dbo].[MGUIAPDetail_Import]
           ([ID]          --對應MGUIAP_Import ID
           ,[LineId]      --列
           ,[U_DocEntry]  -- AP發票內部編號
           ,[U_OBJTYPE]   -- 固定填18
           ,[U_BELNR]     --AP發票單號
           ,[U_BLDAT]     --憑證日期
           ,[U_VATDATE]   --申報日期
           ,[U_STCEG]     --統一編號
           ,[U_XBLNR]     --發票號碼(字軌)
           ,[U_ZFORM_CODE]--21 – 三聯式發票 22 – 二聯式發票 25 – 三聯式收銀機發票,電子發票 26 – 彙總登入伍佰元以下進項三聯式,電子計算統一發票 27 – 彙總登入伍佰以下進項二聯式發票,載有稅額之其他發票 28 – 海關憑證
           ,[U_HWBAS]     --發票未稅總金額
           ,[U_HWSTE]     --發票稅額
           ,[U_TAX_TYPE]  --1-應稅 2-零稅3-免稅
           ,[U_CUS_TYPE]  --0-進項發票 1-其他憑證-內含稅(差旅費) 2-其他憑證-外含稅(水電費)
           ,[U_AM_TYPE]   --1-可扣抵-貨物 2-可扣抵-固定資產 3-不可扣抵-貨物 4-不可扣抵-固定資產 5-土地6-股票股利
           ,[U_VATCODE]   --固定填100
           ,[U_BUKRS]     --固定填100
           ,[U_FA_DESC]   --固資描述
           ,[U_FA_QTY]    --固資數量
           ,[U_FA_USE]	  --固資用途
		   ,[U_GatherMark]--彙總註記 預設值為 N
           ,[U_ConsolidQty]--彙總張數
           ,[U_MWSKZ]     --營業稅代碼 21/22/25/26/27/28
           ,[U_LIFNR])    --供應商代碼(CardCode)
     VALUES
          (1, 1, 31, 18, '31', '2025-10-02 00:00:00.000', '2025-10-02 00:00:00.000',
        '53721864', 'RT20251004', '21', 200, 10, '1', '0', '1', '100', '100',
        '', 0,'', 'N', 0, '21', 'AA013')

GO


